export default function TermsOfUse() {
  return (
    <article className="my-16 p-8 lg:max-w-[70dvw] lg:p-0">
      <h1 className="mb-8 text-2xl font-bold">서비스 이용약관</h1>
      <h2 className="mt-4 font-semibold">1. 목적</h2>
      <p>본 이용약관은 KNOU(이하 "사이트")의 서비스의 이용 조건과 운영에 관한 제반 사항 규정을 목적으로 합니다.</p>

      <h2 className="mt-4 font-semibold">2. 용어의 정의</h2>
      <p>본 약관에서 사용하는 용어는 다음과 같이 정의됩니다.</p>
      <ol className="list-decimal list-inside">
        <li className="mt-2 ml-2">
          이용자: 사이트에 접속하여 본 약관에 따라 회사가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
        </li>
        <li className="mt-2 ml-2">
          회원: 본 약관에 동의하고 회원등록으로 계정을 생성해 서비스를 이용하는 이용자를 말합니다.
        </li>
        <li className="mt-2 ml-2">비회원: 회원등록을 하지 않고 회사의 서비스를 이용하는 이용자를 말합니다.</li>
        <li className="mt-2 ml-2">
          재학생: 한국방송통신대학교에 재학 중이며, 한국방송통신대학교에서 제공하는 이메일 도메인에 접근 가능한 이용자를
          말합니다.
        </li>
        <li className="mt-2 ml-2">
          원천 데이터: 회사가 사이트에 게시하는 한국방송통신대학교 주체의 공개적인 정보를 말합니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">3. 약관의 효력 및 변경</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">회사는 본 약관의 내용을 회원이 확인할 수 있도록 서비스 화면에 개시합니다.</li>
        <li className="mt-2 ml-2">
          회사는 필요한 경우 관련 법령을 위배하지 않는 범위 내에서 본 약관을 개정할 수 있습니다.
        </li>
        <li className="mt-2 ml-2">
          회사는 본 약관을 개정할 경우 적용일자 및 개정 사유를 명시하여 현행약관과 함께 회원에게 고지합니다. 약관의
          변동사항은 시행일자 7일 전부터 서비스 화면 또는 전자우편을 통해 고지합니다.
        </li>
        <li className="mt-2 ml-2">
          회원은 변경된 약관에 동의하지 않을 경우 언제든 회원탈퇴를 진행함으로써 이용계약을 해지할 수 있습니다. 단,
          개정된 이용약관 시행 후 7일 이내에 회원탈퇴를 진행하지 않은 회원은 개정된 약관에 동의한 것으로 간주됩니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">4. 약관 외 준칙</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">본 약관에서 정하지 아니한 사항에 대해서는 관계법령 또는 상관례에 따릅니다.</li>
        <li className="mt-2 ml-2">
          회사는 필요한 경우 본 약관과 더불어 별도의 운영정책을 수립할 수 있으며, 본 약관과 운영정책이 중첩될 경우
          운영정책이 우선 적용됩니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">5. 서비스 제공 및 변경</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">
          회사는 회원에게 다음과 같은 서비스를 제공합니다.
          <p className="ml-2">
            (1) 한국방송통신대학교에서 진행하는 강의에 대한 관련 학과, 강사, 학점, 수업 유형 등의 정보 제공 서비스
          </p>
          <p className="ml-2">(2) 강의 수강후기 공유 서비스</p>
        </li>
        <li className="mt-2 ml-2">
          회사는 원천 데이터에 변경이 있을 경우 사이트에서 제공하는 정보의 내용을 변경할 수 있습니다.
        </li>
        <li className="mt-2 ml-2">
          회사는 운영정책 또는 기술적 사양의 변경 등의 사유로 제공하는 서비스의 일부 또는 전체를 변경할 수 있습니다. 이
          경우 회사는 그 사유를 회원에게 통지 가능한 주소로 즉시 통지합니다. 다만 회사가 사전에 통지할 수 없는 부득이한
          사유가 있는 경우 사후에 통지할 수 있습니다.
        </li>
        <li className="mt-2 ml-2">
          전항의 경우 회사는 이로 인하여 회원이 입은 인과관계가 입증된 실제 손해를 배상합니다. 다만, 회사가 고의 또는
          과실이 없음을 입증하는 경우에는 그러지 아니합니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">6. 서비스의 중단</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">
          회사는 서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검 중에는 서비스 제공이 일시적으로
          중단될 수 있습니다.
        </li>
        <li className="mt-2 ml-2">
          서비스가 일시적으로 중단될 경우 회사는 그 사실 및 사유를 사이트 초기 화면에 고지합니다. 정기점검 시간은
          서비스에 공지한 바에 따릅니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">7. 회원가입</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">
          이용계약은 이용자의 서비스 이용 신청에 대한 회사의 이용 승낙과 이용자의 약관 내용에 대한 동의로 체결됩니다.
        </li>
        <li className="mt-2 ml-2">
          회사는 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다.
          <p className="ml-2">(1) 가입신청자가 본 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우</p>
          <p className="ml-2">(2) 타인의 명의를 도용해 회원가입을 진행한 경우</p>
          <p className="ml-2">(3) 등록 내용에 허위, 기재누락, 오기가 있는 경우</p>
          <p className="ml-2">(4) 기타 회원으로 등록하는 것이 회사의 기술상 현저히 지장이 있다고 판단되는 경우</p>
        </li>
        <li className="mt-2 ml-2">회원가입계약의 성립 시기는 회사의 승낙이 회원에게 도달한 시점으로 합니다.</li>
        <li className="mt-2 ml-2">
          회원은 회원가입 시 등록한 사항에 변경이 있는 경우, 상당한 기간 이내에 회사에 대하여 회원정보 수정 등의
          방법으로 그 변경사항을 알려야 합니다. 회원이 정보의 변경을 알리지 않아 회사가 회원에게 통지를 하지 못함으로써
          회원이 입은 손해에 대하여 회사는 그 고의 또는 중대한 과실이 없는 한 책임을 부담하지 않습니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">8. 회원 탈퇴 및 자격 상실 등</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">회원은 회사에 언제든지 탈퇴를 요청할 수 있으며 회사는 즉시 회원 탈퇴를 처리합니다.</li>
        <li className="mt-2 ml-2">
          회원이 다음 각 호의 사유에 해당하는 경우, 회사는 회원자격을 제한 및 정지시킬 수 있습니다.
          <p className="ml-2">(1) 가입 신청 시에 허위 내용을 등록한 경우</p>
          <p className="ml-2">
            (2) 다른 이용자의 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를 위협하는 경우
          </p>
          <p className="ml-2">(3) 서비스 제공에 대한 회사의 원활한 운영을 방해하는 행위를 하거나 시도한 경우</p>
          <p className="ml-2">(4) 기타 회사가 합리적인 판단에 의하여 필요하다고 인정하는 경우</p>
        </li>
        <li className="mt-2 ml-2">
          회사가 회원 자격을 제한 정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지
          아니하는 경우 회사는 회원 자격을 상실시킬 수 있습니다.
        </li>
        <li className="mt-2 ml-2">
          회사가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록 말소전에
          최소한 7일 이상의 기간을 정하여 소명할 기회를 부여합니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">9. 회원에 대한 통지</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">
          회사가 회원에 대한 통지를 하는 경우, 회원이 회사와 미리 약정하여 지정한 전자우편 주소로 할 수 있습니다. 회원이
          전자우편 주소를 잘못 제출하여 통지가 이루어지지 않는 경우 회사는 회원이 제출한 정보로 발송한 때에 회원에
          통지가 도달한 것으로 간주합니다.
        </li>
        <li className="mt-2 ml-2">
          회사는 불특정 다수 회원에 대한 통지의 경우 1주일 이상 회사 게시판에 게시함으로써 개별 통지에 갈음할 수
          있습니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">10. 회사의 의무</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">
          회사는 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 본 약관이 정하는 바에 따라 지속적이고,
          안정적으로 서비스를 제공하는 데 최선을 다합니다.
        </li>
        <li className="mt-2 ml-2">
          회사는 이용자가 안전하게 서비스를 이용할 수 있도록 이용자의 개인정보(신용정보 포함)보호를 위한 보안 시스템을
          갖추어야 합니다.
        </li>
        <li className="mt-2 ml-2">회사는 이용자가 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.</li>
      </ol>

      <h2 className="mt-4 font-semibold">11. 회원의 ID 및 비밀번호에 대한 의무</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">제13조의 경우를 제외한 이메일 ID와 비밀번호에 관한 관리 책임은 회원에게 있습니다.</li>
        <li className="mt-2 ml-2">회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.</li>
        <li className="mt-2 ml-2">
          회원이 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 회사에 통보하고
          회사의 안내가 있는 경우에는 그에 따라야 합니다.
        </li>
        <li className="mt-2 ml-2">
          회사는 회원이 상기 제1항, 제2항, 제3항을 위반하여 회원에게 발생한 손해에 대하여 아무런 책임을 부담하지
          않습니다.
        </li>
        <li className="mt-2 ml-2">
          회사는 회원의 아이디가 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나 회사 및 회사의
          운영자로 오인할 우려가 있는 경우, 해당 아이디의 이용을 제한할 수 있습니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">12. 회원의 의무</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">
          이용자는 다음 행위를 하여서는 안됩니다.
          <p className="ml-2">(1) 개인정보의 등록(변경의 경우를 포함) 시 허위 내용을 등록</p>
          <p className="ml-2">(2) 타인의 정보 도용</p>
          <p className="ml-2">(3) 타 이용자의 개인정보를 수집, 저장 또는 공개하는 행위</p>
          <p className="ml-2">(4) 사이트에 게시된 정보의 변경</p>
          <p className="ml-2">(5) 회사가 허락하지 않은 정보(컴퓨터 프로그램 등)의 송신 또는 게시</p>
          <p className="ml-2">(6) 회사 및 기타 제3자의 저작권 등 지적 재산권에 대한 침해</p>
          <p className="ml-2">(7) 회사 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위</p>
          <p className="ml-2">
            (8) 외설 또는 폭력적인 메시지, 화상, 음성 기타 공서양속에 반하는 정보를 사이트에 공개 또는 게시하는 행위
          </p>
        </li>
        <li className="mt-2 ml-2">
          회원이 사이트에 게시한 게시물에 대한 모든 권리 및 책임은 회원에게 있습니다. 회원이 게시한 게시물이 다음 각
          호에 해당한다고 판단되는 경우 회사는 해당 게시물을 사전통지 없이 삭제할 수 있으며, 이로 인해 회원에게 발생하는
          불이익에 대해 회사는 어떠한 책임도 지지 않습니다.
          <p className="ml-2">(1) 본인 또는 타인의 개인정보를 포함하는 내용</p>
          <p className="ml-2">(2) 회사 관리자 및 기타 제3자를 사칭하는 내용</p>
          <p className="ml-2">(3) 회사, 회사 관계자 및 기타 제3자를 비방하거나 그의 명예를 훼손시키는 내용</p>
          <p className="ml-2">(4) 허위 사실을 유포하는 내용</p>
          <p className="ml-2">(5) 불법 활동 또는 미풍양속에 위반되는 행동을 장려하는 내용</p>
          <p className="ml-2">(6) 사회적 통념에 어긋나거나 공공질서를 어기는 내용</p>
          <p className="ml-2">(7) 회사로부터 사전승인을 받지 아니한 영리적 목적의 상업광고 또는 판촉 내용</p>
          <p className="ml-2">(8) 회사 및 기타 제3자의 영업 및 서비스 운영을 방해하는 내용</p>
          <p className="ml-2">(9) 피싱 등 유해사이트로 이동하는 웹사이트 링크를 포함하는 내용</p>
          <p className="ml-2">
            (10) 사이트에서 제공하는 서비스의 목적 및 취지와 무관하거나 회사가 정의한 게시물 범위에 부합하지 않는 내용
          </p>
          <p className="ml-2">(11) 회사 및 기타 제3자의 저작권을 침해하는 내용</p>
          <p className="ml-2">(12) 기타 관련 법률을 위반하는 내용</p>
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">13. 개인정보보호</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">
          회사는 회원의 정보 수집 시 서비스의 제공에 필요한 최소한의 정보를 수집합니다. 다음 사항을 필수사항으로 하며 그
          외 사항은 선택사항으로 합니다.
          <p className="ml-2">(1) 이메일(전자우편) 주소</p>
          <p className="ml-2">(2) 아이디</p>
          <p className="ml-2">(3) 비밀번호</p>
        </li>
        <li className="mt-2 ml-2">
          회사는 회원의 개인식별이 가능한 개인정보를 수집하는 때에는 반드시 당해 회원의 동의를 받습니다.
        </li>
        <li className="mt-2 ml-2">
          제공된 개인정보는 당해 회원의 동의없이 목적 외의 이용이나 제3자에게 제공할 수 없으며, 이에 대한 모든 책임은
          회사가 집니다. 다만, 다음의 경우는 예외로 합니다.
          <p className="ml-2">(1) 도용 방지를 위하여 본인 확인에 필요한 경우</p>
          <p className="ml-2">(2) 수사기관이나 기타 정부기관으로부터 정보제공을 요청받은 경우</p>
          <p className="ml-2">(3) 법률의 규정 또는 법률에 의하여 필요한 불가피한 사유가 있는 경우</p>
        </li>
        <li className="mt-2 ml-2">
          회사가 제2항과 제3항에 의해 회원의 동의를 받아야 하는 경우에는 개인정보 관리책임자의 신원(소속, 성명 및
          전화번호, 기타 연락처), 정보의 수집 목적 및 이용 목적, 제3자에 대한 정보 제공 관련 사항(제공받은 자, 제공 목적
          및 제공할 정보의 내용) 등 정보통신 이용촉진 등에 관한 법률 제21조 등에서 규정한 사항을 미리 명시하거나
          고지해야 하며 회원은 언제든지 이 동의를 철회할 수 있습니다.
        </li>
        <li className="mt-2 ml-2">
          회원은 언제든지 회사가 가지고 있는 자신의 개인정보에 대해 열람 및 오류 정정을 요구할 수 있으며 회사는 이에
          대해 지체 없이 필요한 조치를 취할 의무를 집니다. 회원이 오류의 정정을 요구한 경우에는 회사는 그 오류를 정정할
          때까지 당해 개인정보를 이용하지 않습니다.
        </li>
        <li className="mt-2 ml-2">
          회사는 개인정보 보호를 위하여 관리자를 한정하여 그 수를 최소화하며 회원의 개인정보의 분실, 도난, 유출, 변조
          등으로 인한 회원의 손해에 대하여 모든 책임을 집니다.
        </li>
        <li className="mt-2 ml-2">
          회사 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집 목적 또는 제공받은 목적을 달성한 때에는 당해
          개인정보를 지체없이 파기합니다.
        </li>
        <li className="mt-2 ml-2">
          회사가 회원의 개인정보를 수집, 이용, 제공 등을 할 경우에는 개인정보보호법, 정보통신망법에 따라 적법한 절차를
          거칩니다.
        </li>
        <li className="mt-2 ml-2">
          회원은 원하는 경우 언제든 회사에 제공한 개인정보의 수집과 이용에 대한 동의를 철회할 수 있으며 동의의 철회는
          회원 탈퇴를 하는 것으로 이루어집니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">14. 저작권의 귀속 및 이용제한</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">회사가 작성한 저작물에 대한 저작권 및 기타 지식재산권은 회사에 귀속합니다.</li>
        <li className="mt-2 ml-2">
          회원은 서비스를 이용하면서 얻은 정보를 회사의 사전 승인 없이 복제, 송신, 출판, 배포 등 기타 영리적인 목적으로
          이용하거나 제3자에게 이용하게 하여서는 안됩니다.
        </li>
        <li className="mt-2 ml-2">회원이 사이트에 제공하거나 게시한 게시물에 대한 저작권은 회원에게 귀속됩니다.</li>
        <li className="mt-2 ml-2">
          회원은 자신이 제공하거나 게시한 게시물에 대해 회사의 서비스 운영, 개선, 홍보를 위한 범위 내에서 무상의
          비독점적 사용권을 회사에 부여합니다. 회원이 회사에게 부여한 사용권은 회사가 사이트를 운영하는 동안 계속
          유효하며, 회원이 서비스 이용계약을 해지한 후에도 같습니다.
        </li>
        <li className="mt-2 ml-2">
          회원은 게시물에 대해 회사에 사용권을 부여하기 위해 필요한 권리를 보유해야 합니다. 이러한 권리를 보유하지 않아
          발생하는 모든 문제에 대해서는 회원이 책임을 부담하게 됩니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">15. 면책</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">
          회사는 천재지변, 불가항력 및 기타 회사의 합리적인 통제 범위를 벗어난 사유로 인하여 서비스를 제공할 수 없는
          경우에는 그에 대한 책임을 부담하지 않습니다.
        </li>
        <li className="mt-2 ml-2">
          회사는 이용자의 귀책사유로 인하여 서비스를 제공할 수 없는 경우에는 회사의 고의 또는 중대한 과실이 없는 한 그에
          대한 책임을 부담하지 않습니다.
        </li>
        <li className="mt-2 ml-2">
          이용자가 서비스 내에 게재한 정보, 자료, 사실 등의 내용에 관한 신뢰도 또는 정확성에 대하여는 해당 이용자가
          책임을 부담하며, 회사는 내용의 부정확 또는 허위로 인해 이용자 또는 제3자에게 발생한 손해에 대하여는 회사의
          고의 또는 중대한 과실이 없는 한 아무런 책임을 부담하지 않습니다.
        </li>
        <li className="mt-2 ml-2">
          회사는 서비스 이용과 관련하여 이용자의 고의 또는 과실로 인하여 이용자 또는 제3자에게 발생한 손해에 대하여는
          회사의 고의 또는 중대한 과실이 없는 한 아무런 책임을 부담하지 않습니다.
        </li>
        <li className="mt-2 ml-2">
          회사는 회원 간 또는 회원과 제3자 상호간에 서비스를 매개로 하여 맺은 거래관계 등에 대해 어떠한 책임도 지지
          않습니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">16. 분쟁해결</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">
          회사는 이용자로부터 제출되는 불만사항 및 의견을 우선적으로 처리합니다. 다만, 신속한 처리가 곤란한 경우에는
          이용자에게 그 사유와 처리 일정을 통보합니다.
        </li>
        <li className="mt-2 ml-2">
          서비스 이용과 관련하여 회사와 회원 사이에 분쟁이 발생한 경우, 회사와 회원은 분쟁의 해결을 위해 성실히
          협의합니다.
        </li>
      </ol>

      <h2 className="mt-4 font-semibold">17. 재판권 및 준거법</h2>
      <ol className="list-decimal list-inside">
        <li className="ml-2">
          제16조의 협의에서도 분쟁이 해결되지 않을 경우 양 당사자는 민사소송법상의 관할법원에 소를 제기할 수 있습니다.
        </li>
        <li className="mt-2 ml-2">회사와 회원 간에 제기된 소송에는 대한민국 법을 적용합니다.</li>
      </ol>

      <h2 className="mt-4 font-semibold">부칙</h2>
      <p>공고일자: 2024년 8월 26일</p>
      <p>시행일자: 2024년 8월 26일</p>
    </article>
  );
}
